/* Translation.strings\n    SAPTracker\n  \n    Created by Raimund Wege on 27.07.16.\n    Copyright © 2016 com.sap.sailing. All rights reserved.\n  \n\n   MARK: - Common */
"Common.Cancel" = "中止";

"Common.OK" = "OK";

"Common.Info" = "情報";

"Common.Warning" = "警告";

"Common.Error" = "エラー";

"Common.Yes" = "はい";

"Common.No" = "いいえ";

"Common.Settings" = "設定";

"Common.Logout" = "ログアウト";

/* MARK: - Endpoint */
"Endpoint.Training" = "https://ubilabstest.sapsailing.com";

/* MARK: - RegattaCheckInController */
"RegattaCheckInController.WelcomeAlert.Title" = "%@ さん、こんにちは";

"RegattaCheckInController.WelcomeAlert.Message" = "%@ としてサインインしようとしています。";

"RegattaCheckInController.WelcomeAlert.CancelAction.Title" = "それは自分ではありません";

/* MARK: - GPSFixController */
"GPSFixController.Mode" = "モード";

"GPSFixController.Mode.Error" = "API エラー";

"GPSFixController.Mode.BatterySaving" = "バッテリー節約";

"GPSFixController.Mode.None" = "-";

"GPSFixController.Mode.Online" = "オンライン";

"GPSFixController.Mode.Offline" = "オフライン";

/* MARK: - LocationManager */
"LocationManager.LocationServicesDeniedError" = "GPS がこのアプリに対してオフになっていますが、追跡には GPS 位置が必要です。場所の設定で GPS をオンにしますか。";

"LocationManager.LocationServicesDisabledError" = "GPS がオフになっていますが、追跡には GPS 位置が必要です。場所の設定で GPS をオンにしますか。";

"LocationManager.Status" = "ステータス";

"LocationManager.Status.Tracking" = "追跡";

"LocationManager.Status.NotTracking" = "GPS 信号がありません。";

/* MARK: - CheckInDataCollectorError */
"CheckInDataCollectorError.CheckInDataIsIncomplete" = "QR コードで競技者またはマーク ID が見つかりませんでした。";

/* MARK: - CheckInRequestManagerError */
"CheckInRequestManagerError.CommunicationFailed" = "サーバ上で操作を完了できませんでした。再試行してください。";

"CheckInRequestManagerError.GetBoatFailed" = "艇を取得できませんでした。";

"CheckInRequestManagerError.GetCompetitorFailed" = "競技者を取得できませんでした。";

"CheckInRequestManagerError.GetEventFailed" = "イベントを取得できませんでした。";

"CheckInRequestManagerError.GetLeaderboardFailed" = "リーダーボードを取得できませんでした。";

"CheckInRequestManagerError.GetMarkFailed" = "マークを取得できませんでした。";

"CheckInRequestManagerError.GetTeamFailed" = "チームを取得できませんでした。";

"CheckInRequestManagerError.PostCheckInFailed" = "チェックインに失敗しました。";

"CheckInRequestManagerError.PostCheckOutFailed" = "チェックアウトに失敗しました。";

"CheckInRequestManagerError.PostGPSFixFailed" = "GPS 位置を送信できませんでした。";

"CheckInRequestManagerError.PostTeamImageFailed" = "チーム画像をアップロードできませんでした。";

"CheckInRequestManagerError.TeamImageURLIsInvalid" = "チーム画像 URL が無効です。";

/* MARK: - StartView */
"StartView.RegattaButton.Title" = "レガッタ";

"StartView.TrainingButton.Title" = "単一トレーニング";

/* MARK: - AboutView */
"AboutView.Title" = "このアプリについて";

"AboutView.PartnershipTextView.Text" = "SAP Sail InSight アプリは、モバイルフォン技術の活用によりレース参加艇の実況追跡をサポートしており、実況リーダーボードと 2D 表示によってオンサイトであるかオンラインであるかに関係なくレースを友人やファンがフォローする機能を実現しています。レースをフォローすることによって、セーラーはそのレースを再生してパフォーマンスをレビューする機会が得られ、戦略を最適化することができます。そのすべてが https://www.sapsailing.com で利用可能です。\n\nSAP は革新的な技術ソリューションの導入によって US Sailing をサポートしており、セーリング競技の運営がより効率的になるよう支援するアプリケーションの提供も行うと同時に、チームとセーラーのパフォーマンス向上に役立つ分析機能を提供しています。\n\nセーリング競技の全米運営組織として、US Sailing は全国の競技セーリングの管理および監督とともに、インストラクターや競技役員向けのトレーニングおよび教育プログラムを含めこのスポーツに対してリーダーシップ、品位、そして成長をもたらしています。";

"AboutView.TermsButton.Title" = "EULA";

"AboutView.VersionTitleLabel.Text" = "バージョン";

/* MARK: - CourseView */
"CourseView.TitleLabel.Text" = "対地コース";

/* MARK: - RegattaCheckInListView */
"RegattaCheckInListView.Title" = "レガッタ";

"RegattaCheckInListView.HeaderTitleLabel.Text" = "指定したレガッタ:";

"RegattaCheckInListView.FooterTextView.Text" = "詳細については、\nhttps://sapsailing.com を参照";

"RegattaCheckInListView.InfoCodeLabel.Text" = "参加の確認について QR コードを見つけることができました。";

"RegattaCheckInListView.TermsAlert.Title" = "EULA";

"RegattaCheckInListView.TermsAlert.Message" = "このアプリを使用することによって、SAP SE エンドユーザライセンス契約を受け入れる確認を行います。この EULA をここで参照してください。";

"RegattaCheckInListView.TermsAlert.ShowTermsAction.Title" = "EULA";

"RegattaCheckInListView.TermsAlert.AcceptTermsAction.Title" = "確認";

"RegattaCheckInListView.NoCameraAlert.Message" = "デバイスにカメラがありません。";

"RegattaCheckInListView.NoCodeAlert.Title" = "QR コードがありますか。";

"RegattaCheckInListView.NoCodeAlert.Message" = "QR コードを受け取っていない場合はレース管理者に問い合わせてください。";

/* MARK: - TrainingCheckInListView */
"TrainingCheckInListView.Title" = "トレーニング";

"TrainingCheckInListView.HeaderTitleLabel.Text" = "指定したトレーニング:";

"TrainingCheckInListView.FooterTextView.Text" = "トレーニングセッションを管理するには、プラスボタンを使用して少なくとも 1 つトレーニングを登録してください。";

/* MARK: - TrainingView */
"TrainingView.LeaderboardButton.Title" = "分析";

"TrainingView.OptionSheet.CheckOutAction.Title" = "トレーニング削除";

"TrainingView.FinishButton.Title" = "終了";

"TrainingView.ReactivateAlert.Title" = "トレーニングの再有効化";

"TrainingView.ReactivateAlert.Message" = "このトレーニングセッションは終了しました。先に進んでこのセッションを再有効化しますか。";

"TrainingView.ReactivatedAlert.Title" = "トレーニングセッションが有効になりました。";

"TrainingView.FinishAlert.Title" = "トレーニング終了";

"TrainingView.FinishAlert.Message" = "このトレーニングセッションを終了しますか。";

"TrainingView.FinishedAlert.Title" = "トレーニングセッションが終了しました。";

"TrainingView.CheckOutAlert.Message" = "デバイスからこのトレーニングセッションを削除しますか。";

/* MARK: - CreateTrainingView */
"CreateTrainingView.Title" = "トレーニング作成";

"CreateTrainingView.BoatClassNameLabel.Text" = "艇種";

"CreateTrainingView.CreateTrainingButton.Title" = "トレーニング作成";

/* MARK: - LeaderboardView */
"LeaderboardView.Title" = "リーダーボード";

/* MARK: - LicenseView */
"LicenseView.Title" = "ライセンス情報";

/* MARK: - RegattaView */
"RegattaView.CountdownDaysTitleLabel.Text" = "日";

"RegattaView.CountdownHoursTitleLabel.Text" = "時間";

"RegattaView.CountdownMinutesTitleLabel.Text" = "分";

"RegattaView.StartLabel.Text.BeforeRegattaDidStart" = "レガッタがスタートするまでの時間:";

"RegattaView.StartLabel.Text.AfterRegattaDidStart" = "レガッタが進行中です。";

"RegattaView.AnnouncementLabel.Text" = "アナウンスを聞いてください。";

"RegattaView.EventButton.Title" = "イベント";

"RegattaView.StartTrackingButton.Title" = "追跡開始";

"RegattaView.OptionSheet.CheckOutAction.Title" = "チェックアウト";

"RegattaView.CheckOutAlert.Message" = "ログアウトしますか。レガッタにアクセスするには指定された QR コードで再ログインする必要があります。";

/* MARK: - CompetitorView */
"CompetitorView.SelectImageAlert.Title" = "写真";

"CompetitorView.SelectImageAlert.Message" = "既存の画像を使用しますか。それとも新たに画像を取得しますか。";

"CompetitorView.SelectImageAlert.CameraAction.Title" = "写真撮影";

"CompetitorView.SelectImageAlert.PhotoLibraryAction.Title" = "既存";

"CompetitorView.TeamImageUploadRetryButton.Title" = "アップロード時にエラーが発生しました。\nタップして再試行してください。";

"CompetitorView.TeamImageAddButton.Title" = "チーム写真追加";

"CompetitorView.UploadTeamImageFailureAlert.Title" = "画像のアップロードでエラー発生";

/* MARK: - ScanView */
"ScanView.Title" = "QR コードのスキャン";

"ScanView.IncorrectCodeAlert.Message" = "QR コードが無効";

/* MARK: - SpeedView */
"SpeedView.TitleLabel.Text" = "対地速力";

/* MARK: - SettingsView */
"SettingsView.Title" = "設定";

"SettingsView.TableView.BatterySavingSection.Title" = "バッテリー節約";

"SettingsView.TableView.DeviceSection.Title" = "デバイス情報";

"SettingsView.TableView.TrainingSection.Title" = "トレーニングエリア";

"SettingsView.BatterySavingTitleLabel.Text" = "エネルギー節約";

"SettingsView.BatterySavingDescriptionLabel.Text" = "GPS アップデートを %0.0f 秒ごとにサーバに送信中です。";

"SettingsView.DeviceIdentifierTitleLabel.Text" = "デバイス ID";

"SettingsView.TrainingServerTitleLabel.Text" = "サーバエンドポイント";

/* MARK: - TimerView */
"TimerView.TitleLabel.Text" = "追跡時間";

/* MARK: - TrackingView */
"TrackingView.TableView.GPSFixesCell.GPSFixesTitleLabel.Text" = "未送信フィックス";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyTitleLabel.Text" = "GPS 精度";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyLabel.Text.NoGPS" = "GPS がありません";

"TrackingView.StopTrackingButton.Title" = "追跡停止";

"TrackingView.StopTrackingAlert.Title" = "確認してください";

"TrackingView.StopTrackingAlert.Message" = "追跡を停止しますか。";

